<?php

use Illuminate\Database\Seeder;

class news_seeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('news')->insert([
            'title' => 'ขอเชิญชาววิศวฯ จุฬาฯ ร่วมงาน คืนสู่เหย้าปราสาทแดง วันเสาร์ที่ 30 มกราคม 2559 เวลา 18.00 น. ณ ลานเกียร์',
            'content' => 'ขอเชิญชาววิศวฯ จุฬาฯ ร่วมงาน คืนสู่เหย้าปราสาทแดง วันเสาร์ที่ 30 มกราคม 2559 เวลา 18.00 น. ณ ลานเกียร์',
            'image' => 'sprailthkhuuensuuehyaa.jpg',
            'at_home' => true,
            'created_at' => new DateTime(),
            'updated_at' => new DateTime()
        ]);

        DB::table('news')->insert([
            'title' => 'รพ.พระมงกุฏฯ ผนึกพลังวิศวฯ จุฬาฯ สร้างชื่อก้องโลก หลังผ่าตัดใส่กระดูกเทียมโลหะไทเทเนียม ทดแทนกระดูกนิ้วหัวแม่มือได้สำเร็จเป็นครั้งแรกของโลก',
            'content' => 'ทีมแพทย์กองออร์โธปิดิกส์ รพ.พระมงกุฎเกล้า ร่วมกับ ทีมวิจัยจากภาควิชาวิศวกรรมโลหการ คณะวิศวกรรมศาสตร์ จุฬาฯ ประสบความสำเร็จในการสร้างและผ่าตัดใส่กระดูกเทียมผลิตจากโลหะไทเทเนียมที่ผลิตขึ้นเองในประเทศไทย เพื่อใส่ทดแทนกระดูกนิ้วหัวแม่มือที่ถูกทำลายจนหมดจากเนื้องอกกระดูกเป็นรายแรกของโลก นับเป็นอีกก้าวแห่งพัฒนาการด้านวิศวกรรมทางการแพทย์ของไทยที่จะช่วยยกระดับคุณภาพชีวิตของผู้ป่วยที่ด้อยโอกาสในเมืองไทยให้ได้เข้าถึงการรักษาได้อย่างทั่วถึง และเพื่อเป็นการขยายความร่วมมือด้านวิศวกรรมการแพทย์ วิศวฯ จุฬาฯ ยินดีที่จะร่วมมือกับโรงพยาบาลต่างๆ ทั่วประเทศ เพื่อวิจัยและคิดค้นในด้านดังกล่าวอย่างต่อเนื่อง

วันที่ 26 มกราคม 2559 พลโท รศ. นพ.ไตรโรจน์ ครุธเวโช เจ้ากรมแพทย์ทหารบก และ ศ. ดร. บัณฑิต เอื้ออาภรณ์ คณบดีคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ร่วมกันแถลงข่าว ความร่วมมือระหว่างกรมแพทย์ทหารบก โดย กองออร์โธปิดิกส์ โรงพยาบาลพระมงกุฎเกล้า และคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ในความสำเร็จของการผ่าตัดใส่กระดูกไทเทเนียมจากการพิมพ์สามมิติ ทดแทนกระดูกนิ้วหัวแม่มือที่ถูกทำลายในผู้ป่วยเนื้องอกกระดูกเป็นรายแรกของโลก

สำหรับทีมวิจัยทางการแพทย์ในโครงการดังกล่าว ประกอบด้วย พันเอก รศ. นพ. สุพิชัย เจริญวารีกุล ผู้อำนวยการกองออร์โธปิดิกส์ พ.อ. รศ. นพ.ทิพชาติ บุณยรัตพันธุ์ หัวหน้าทีมแพทย์ผ่าตัด กองออร์โธปิดิกส์ พ.ท. รศ. นพ.สุริยา ลือนาม หัวหน้าหน่วยออร์โธปิดิกส์ทางมือ กองออร์โธปิดิกส์ โรงพยาบาลพระมงกุฎเกล้า ผศ. ดร.บุญรัตน์ โล่ห์วงศ์วัฒน และ อ. ดร.เชษฐา พันธ์เครือบุตร ภาควิชาวิศวกรรมโลหการ คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย์',
            'image' => 'sprailthphramng.jpg',
            'at_home' => true,
            'created_at' => new DateTime(),
            'updated_at' => new DateTime()
        ]);

        DB::table('news')->insert([
            'title' => 'ทุนนิสิตแลกเปลี่ยนเพื่อทำวิจัยที่สถาบันเทคโนโลยีแมสซาชูเซตส์ (Massachusetts Institute of Technology, MIT) ประเทศสหรัฐอเมริกา ปีการศึกษา 2559',
            'content' => 'ด้วยคณะวิศวกรรมศาสตร์ได้จัดสรรทุนนิสิตแลกเปลี่ยนเพื่อทำวิจัยที่ห้องปฏิบัติการวิจัยของ Professor Robert Langer สถาบันเทคโนโลยีแมสซาชูเซตส์ ประเทศสหรัฐอเมริกา (Langer lab, Massachusetts Institute of Technology, MIT, http://web.mit.edu/langerlab/) ในสาขา Tissue engineering and delivery systems สำหรับปีการศึกษา 2559 จำนวน 1 ทุน

นิสิตที่ได้รับคัดเลือกจะได้ไปทำวิจัยที่ห้องปฏิบัติการวิจัยของ Professor Robert Langer เป็นระยะเวลา 1  ปี

คุณสมบัติของผู้สมัคร
1. เป็นนิสิตระดับปริญญาตรีชั้นปีสุดท้าย หรือ นิสิตระดับบัณฑิตศึกษา คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย หรือ บัณฑิตที่สำเร็จการศึกษาจากคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย
2. มีเกรดเฉลี่ยสะสม (GPAX) 3.30 ขึ้นไป
3. มีความรู้ภาษาอังกฤษดีมาก สามารถสื่อสารได้อย่างมีประสิทธิภาพ
4. เป็นผู้มีความประพฤติดี มีความรับผิดชอบ มีมนุษยสัมพันธ์ดี สามารถทำงานร่วมกับผู้อื่นได้ทั้งในฐานะผู้นำและผู้ตาม
รายละเอียด
1. การคัดเลือกรอบแรก (การสัมภาษณ์) ภายในเดือนมีนาคม 2559
2. ผู้ผ่านการคัดเลือกรอบแรกจะต้องร่วมทำกิจกรรมเพื่อแสดงศักยภาพในการทำวิจัยในช่วงเดือน มีนาคม-พฤษภาคม 2559 ตามที่คณะวิศวกรรมศาสตร์กำหนด
3. ประกาศผลผู้ที่ผ่านการคัดเลือกรอบสุดท้ายภายในเดือนพฤษภาคม 2559
4. ผู้ผ่านคัดเลือกรอบสุดท้ายจะต้องเข้ารับการฝึกทักษะในการทำวิจัยเบื้องต้นในสาขา Tissue engineering and delivery systems ในช่วงเดือนมิถุนายน-กรกฎาคม 2559 และจะต้องมีสถานะเป็นนิสิตระดับบัณฑิตศึกษาในหลักสูตรสหสาขาวิศวกรรมชีวเวช (Biomedical Engineering) คณะวิศวกรรมศาสตร์ ในภาคการศึกษาต้น ปีการศึกษา 2559 โดยต้องผ่านการคัดเลือกเข้าศึกษาในหลักสูตรสหสาขาวิศวกรรมชีวเวชตามที่คณะกรรมการบริหารหลักสูตรฯ กำหนด จึงจะสามารถรับทุนแลกเปลี่ยนนี้ได้
5. เมื่อสิ้นสุดระยะเวลารับทุน ผู้รับทุนแลกเปลี่ยนจะต้องกลับมาศึกษาในหลักสูตรสหสาขาวิศวกรรมชีวเวช คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย จนสำเร็จการศึกษาในระดับบัณฑิตศึกษา
6. ทุนนี้ครอบคลุมค่าใช้จ่ายในการเดินทาง ค่าที่พัก ค่าเบี้ยเลี้ยง และค่าลงทะเบียนรักษาสภาพนิสิตของจุฬาลงกรณ์มหาวิทยาลัย (1 ปีการศึกษา) ในช่วงที่ไปทำวิจัยที่สถาบันเทคโนโลยีแมสซาชูเซตส์ ประเทศสหรัฐอเมริกา ตามระเบียบของจุฬาลงกรณ์มหาวิทยาลัยเท่านั้น ไม่ครอบคลุมค่าธรรมเนียมการศึกษาตลอดหลักสูตรระดับบัณฑิตศึกษาของจุฬาลงกรณ์มหาวิทยาลัย

เอกสารการสมัคร
1. CV พร้อมรูปถ่ายหน้าตรง (ประวัติส่วนตัว การศึกษา กิจกรรม ความสามารถพิเศษ)
2. ผลการทดสอบภาษาอังกฤษ เช่น CUTEP, TOFEL, IELSE หรือหลักฐานอื่นๆที่แสดงถึงความสามารถในการใช้ภาษาอังกฤษในระดับดีมาก
3. ผลการเรียน (Transcript) ในระดับอุดมศึกษาทุกระดับชั้นจนถึงปัจจุบัน
4. เรียงความภาษาอังกฤษ ความยาวไม่เกิน 1 หน้าA4 เกี่ยวกับประสบการณ์หรือความสนใจในงานด้าน Tissue engineering and delivery systems
5. เอกสารประกอบอื่นๆ ตามข้อ 1 เช่น ประกาศนียบัตรต่างๆ (ถ้ามี)

ผู้สนใจสามารถติดต่อสอบถามข้อมูลเพิ่มเติมได้ที่ รศ. ดร.ศิริพร ดำรงค์ศักดิ์กุล siriporn.d@chula.ac.th  โทร 02-2186862  และส่งเอกสารการสมัครจำนวน 2 ชุด โดยลงนามรับรองเอกสารทุกชิ้น ที่ฝ่ายวิรัชกิจฯ คณะวิศวกรรมศาสตร์ ภายในวันที่ 4 มีนาคม 2559',
            'image' => 'spotlight-mit.jpg',
            'at_home' => false,
            'created_at' => new DateTime(),
            'updated_at' => new DateTime()
        ]);

        DB::table('news')->insert([
            'title' => 'ติดตามข่าวสารจากวิศวฯ จุฬาฯ ได้รวดเร็วฉับไวได้ที่ LINE@ Chula Engineering',
            'content' => 'ติดตามข่าวสาร วิศวฯ จุฬาฯ ได้รวดเร็วฉับไวได้ที่ LINE@ Chula Engineering

http://line.me/ti/p/%40wdp8956f',
            'image' => 'spot_line.jpg',
            'at_home' => true,
            'created_at' => new DateTime(),
            'updated_at' => new DateTime()
        ]);

        DB::table('news')->insert([
            'title' => 'Grand challenges, Trends, Chula Engineering Roadmap 2030 results',
            'content' => 'CHULA ENGINEERING ROAD MAP 2030



Challenges for CU ENG

    Much greater competition locally & globally
    Right balance across quality of student, financial aid funding, and diversification of students
    Need to make a big shift from highly-specialised education models to broader-based ones
    Need to develop distinctive strengths, new pathway to innovation, and commercialisation
    CU goals and priorities



วิธีการมองอนาคตระยะยาว Foresight: Known, Unknown, and Need to know signals',
            'image' => 'roadmap2030.jpg',
            'at_home' => false,
            'created_at' => new DateTime(),
            'updated_at' => new DateTime()
        ]);
    }
}
